Terraform checks (init/validate/plan) results:

### Terraform checks for `terraform`


**terraform init:**
```

Initializing the backend...
Initializing provider plugins...
- Finding latest version of hashicorp/google...
- Finding latest version of hashicorp/null...
- Installing hashicorp/google v6.45.0...
- Installed hashicorp/google v6.45.0 (signed by HashiCorp)
- Installing hashicorp/null v3.2.4...
- Installed hashicorp/null v3.2.4 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.


```

**terraform validate:**
```

Success! The configuration is valid.



```

**terraform plan:**
```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_bigquery_dataset.main["analytics_dev"] will be created
  + resource "google_bigquery_dataset" "main" {
      + creation_time              = (known after apply)
      + dataset_id                 = "analytics_dev"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + description                = "Dataset for analytics in the dev environment"
      + effective_labels           = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "analytics"
        }
      + etag                       = (known after apply)
      + friendly_name              = "Dev Analytics Dataset"
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + labels                     = {
          + "environment" = "dev"
          + "team"        = "analytics"
        }
      + last_modified_time         = (known after apply)
      + location                   = "us-central1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "prj-gcp-dev-1111"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "analytics"
        }

      + access {
          + role           = "roles/bigquery.dataEditor"
          + user_by_email  = "dev@example.com"
            # (4 unchanged attributes hidden)
        }
      + access {
          + group_by_email = "analytics-team@example.com"
          + role           = "roles/bigquery.dataViewer"
            # (4 unchanged attributes hidden)
        }
    }

  # google_pubsub_topic.main["dev-event-streaming-topic"] will be created
  + resource "google_pubsub_topic" "main" {
      + effective_labels = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "purpose"                    = "event-streaming"
        }
      + id               = (known after apply)
      + labels           = {
          + "environment" = "dev"
          + "purpose"     = "event-streaming"
        }
      + name             = "dev-event-streaming-topic"
      + project          = "prj-gcp-dev-1111"
      + terraform_labels = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "purpose"                    = "event-streaming"
        }

      + message_storage_policy (known after apply)
    }

  # google_pubsub_topic_iam_member.main["dev-event-streaming-topic/roles/pubsub.pu
... (truncated) ...

```